Repository: imatem/collective.judgment
Catalog: src/collective/judgment/locales/*/LC_MESSAGES/collective.judgment.po
Languages: es

source: Academic Technician
es: Técnico Académico

source: Add
es: Agregar

source: Adds first name and last name fields
es: Agrega campos de nombre y apellidos

source: All cases in
es: Todos los casos en

source: All evaluators can view the comments
es: Sus comentarios son vistos por el resto de los evaluadores

source: Allow evaluation for an item
es: Permite la evalución de elementos

source: An indefinite academic appointment
es: Un contrato académico permanente

source: Annual Evaluation
es: Recontratación

source: Annual Evaluation of Faculty and Staff
es: Recontratación de académicos

source: Approve
es: Aprobar

source: Classification
es: Clasificación

source: Creation Date:
es: Fecha de Creación:

source: Current Position
es: Nombramiento

source: Description
es: Descripción

source: Disapprove
es: Rechazar

source: Documentation
es: Documentación

source: Download
es: Descargar

source: Edit
es: Editar

source: Evaluation
es: Evaluación

source: Evaluation Date
es: Fecha de evaluación

source: File
es: Archivo

source: First Name
es: Nombre

source: ImageThumb
es: Imagen miniatura

source: Installs the collective.judgment add-on.
es: Instala el paquete collective.judgment

source: Invalid Type File: please correct it, only accept pdf file
es: Tipo de archivo inválido: Sólo acepta archivos PDF

source: Last Name
es: Apellido(s)

source: Left Time (in days):
es: Tiempo Restante (en días):

source: Lets you upload a file to the site.
es: Subir un archivo el sitio

source: Pdf File
es: Archivo Pdf

source: Pdf Files
es: Archivos Pdf

source: Pending review
es: En revisión

source: Personal Data
es: Datos personales

source: Promotion
es: Promoción

source: Promotion of Faculty and Staff
es: Promoción de Investigadores y Técnicos Académicos

source: Requested position
es: Nombramiento Solicitado

source: Researcher
es: Investigador

source: Select type
es: Selecciona el tipo

source: Studied
es: Casos estudiados

source: Tenure
es: Definitividad

source: There are currently no items in this folder.
es: No hay items contenidos en esta carpeta

source: Title
es: Título

source: Uninstalls the collective.judgment add-on.
es: Desinstala el paquete collective.judgement

source: View
es: Vista

source: View History
es: Histórico

source: What do you think of this case?
es: ¿Qué opina de este caso?

source: Yes
es: Sí

source: You already evaluated this case.
es: Usted ya evaluó este caso

source: label_error_dates
es: La Fecha de Evaluación debe ser mayor que la Fecha de Creación

source: label_error_orderpositions
es: El Nombramiento solicitado debe ser mayor que el Nombramiento Actual

source: label_filter
es: Buscar

source: label_sendmail
es: Enviar correo
